#1. Напишите программу, которая найдёт произведение пар чисел списка. 
#Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]

from random import randint

x = int(input('Введите размер списка: '))
list1 = []
list2 = []

for i in range(x):
    list1.append(randint(0, 10))
print('Заданный список: ',list1)

for i in range((len(list1) + 1) // 2):
    list2.append(list1[i]*list1[-1 - i])      
print('Произведение пар чисел: ',list2)