# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь,
# ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


# d_list = [['Иван', 'И'], ['Мария', 'М'], ['Петр', 'П'], ['Илья', 'И'], ['Марина', 'М'], ['Петр', 'П'], ['Алина', 'А'],
# ['Бибочка', 'Б']]
# print(d_list['И'])
# list_m = ['Мария', 'Марина']
# list_i = ['Иван', 'Илья']
# list_p = ['Петр', 'Петр']
# list_a = ['Алина']
# ist_b = ['Бибочка']
#
# d = {
# key: value
#    'П': list_p,
#    'И': list_i,
#    'М': list_m,
#    'А': list_a,
#   'Б': list_b,
# }
#
# print(f'Итого, значения следующие - {d}')
# print('Пар ключей в нашем словаре составляет: ', len(d))


def dict_creater(string: str) -> dict:
    name_list = sorted(string.split())
    m_dict = {}
    for name in name_list:
        if name[0] in m_dict:
            m_dict[name[0]].append(name)
        else:
            m_dict[name[0]] = [name]

    return m_dict


any_names = input('Введите имена строго через пробел: ')

func_result = dict_creater(any_names)
print(func_result)
